import os  # модуль который позволяет делать всякие системные вызовы


import os


# силами os порождаем дочерний процесс
print(f"Начинаю работу в процессе {os.getpid()}")  # получаем id процесса
num_proc = int(input("Введите количество вызовов fork в цикле: "))

for i in range(num_proc):
    pid_marker = os.fork()
    if pid_marker != 0:
        print(f"Порождаю дочерний процесс {pid_marker} из процесса {os.getpid()}")
print(f"*** Продолжаю работу в процессе {os.getpid()}")










# print(f"Порождаю дочерний процесс {os.fork()} из процесса {os.getpid()}")  # отработает в родительском и дочернем
# print(f"Продолжаю работу в процессе {os.getpid()}")
# print(f"Снова порождаю дочерний процесс {os.fork()} из процесса {os.getpid()}")
# print(f"Продолжаю работу в процессе {os.getpid()}")


# силами os порождаем дочерний процесс
print(f"Начинаю работу в процессе {os.getpid()}")  # получаем id процесса
print(f"Порождаю дочерний процесс {os.fork()} из процесса {os.getpid()}")  # отработает в родительском и дочернем
print(f"Продолжаю работу в процессе {os.getpid()}")
print(f"Снова порождаю дочерний процесс {os.fork()} из процесса {os.getpid()}")
print(f"Продолжаю работу в процессе {os.getpid()}")








# Домашнее задание: написать программу, которая в какой-то момент получала бы от пользователя с экрана количество
# процессов, которое нужно запустить, начиная с этой точки.